{
    "quotes": [
        {
            "quote": "It is a little like trying to lose weight: everyone knows what it takes, everyone wants to do it, yet it is next to impossible for so many. The stakes here are higher, however. It is not just a matter of losing a few extra pounds. It is a matter of losing the chance to have a life worth living.",
            "author": "Mihaly Csikszentmihalyi",
            "type": "Flow : Book by Mihaly Csikszentmihalyi"
        },
        {
            "quote": "Yeah, I think it's important to have a future that is inspiring and appealing. I mean, I just think that there have to be reasons that you get up in the morning and you want to live. Like why do you want to live? What's the point? What inspires you? What do you love about the future. And if we're not out there. If the future does not include being out there among the stars and being a multi-planet species, I find that's incredibly depressing if that's not the future that we're going to have.",
            "author": "Elon Musk",
            "type": "TedX Talk"
        },
        {
            "quote": "Rarely did Tesla get hung up overanalyzing a situation. The company would pick a plan of attack, and when it failed at something, it failed fast and then tried a new approach.",
            "author": "Ashlee Vance",
            "type": "Elon Musk : Biography by Ashlee Vance"
        },
        {
            "quote":"Good ideas are always crazy until they're not.",
            "author":"Larry Page",
            "type": "Elon Musk : Biography by Ashlee Vance"
        },
        {
            "quote": "A thoroughly socialized person is one who desires only the rewards that others around him have agreed he should long for -- rewards often grafted onto genetically programmed desires. He may encounter thousands of potentially fulfilling experiences, but he fails to notice them because they are not the things he desires.",
            "author": "Mihaly Csikszentmihalyi",
            "type": "Flow : Book by Mihaly Csikszentmihalyi"
        },
        {
            "quote": "The most important step in emancipating oneself from social controls is the ability to find rewards in the events of each moment.",
            "author": "Mihaly Csikszentmihalyi",
            "type": "Flow : Book by Mihaly Csikszentmihalyi"
        },
        {
            "quote": "That's why we call it the innovator's dilemma: doing the right thing is the wrong thing.",
            "author": "Clayton M. Christensen",
            "type": "The Innovator's Dilemma : Book by Clayton M. Christensen"
        },
        {
            "quote": "There are times at which it is right not to listen to customers, right to invest in developing lower-performance products that promise lower margins, and right to aggresively pursue small, rather than substantial, markets.",
            "author":"Clayton M. Christensen",
            "type": "The Innovator's Dilemma : Book by Clayton M. Christensen"
        }
    ]
}